내레이션 : 
UML은 'Unified Modeling Language'의 약자이며, '통합된 모델링 언어'라고 할 수 있습니다. 

이번 시간에는 UML의 의미에 대해 살펴보도록 하겠습니다.

앞에서 UML은 'Unified Modeling Language'의 약자라고 했는데요.
그렇다면, UML은 무엇을 통합했기에 'Unified‘라는 단어를 갖게 되었을까요?
그 이유는 바로 다음과 같이 산재되어있던 여러 객체 지향 방법론에서 사용하던 표기법을 통합하여 생성하였기
때문입니다. 

그럼 UML의 ‘ML’은 어떠한 의미일까요?
‘UML의 ‘ML’은 모델링 언어라는 의미로서, 여기서 모델링이란 시스템을 추상화하는 것을 말합니다.
이렇게 시스템을 추상화하는 과정에서 사용하기 때문에 UML을 모델링 언어라고 하는 것인데요.
결국 UML은 시스템 모델링에 사용하는 통합된 모델링 언어라는 것입니다. 

객체 지향 방법론의 표기법이 통합되어 발전하게 된 배경을 그림으로 나타내면 다음과 같은데요. 
Booch'91과 OMT-1, 그리고 OOSE라는 것은 객체 지향 방법론의 이름입니다.
UML은 이러한 여러 방법론에서 사용하던 표기법들을 통합하여 표준으로 채택하였는데, UML의 표기법을 상세하게
들여다보면 클래스와 객체에 대한 표기에서는 OMT의 영향을  받았다는 것을 알 수 있습니다.
UML은 OMG라 하는 표준화 단체에서 1997년 표준으로 채택된 이래 꾸준히 개정되어 왔으며, 주요한 버전은 1.3과
1.5이고, UML의 현재 버전은 2.0입니다. 

보충 버튼을 클릭하여 UML에서 통합의 의미는 무엇인지 확인해 보세요.

=================================
내레이션 : 
UML은 시스템의 아티팩트를 가시화, 명세화하며, 구축하고 문서화하는 비주얼 언어를 말합니다. 

이번 시간에는  ‘가시화’, ’명세화’, ‘구축’, ‘문서화’라는 키워드를 중심으로 UML의 특징에 대해 살펴보도록
하겠습니다.

UML은 객체 지향 방법론과 CBD방법론, 구현플랫폼에서 사용할 수 있으며, 어플리케이션 도메인에도 적용할 수 있는데요. UML의 특징을 살펴보면 다음과 같습니다.
클릭 버튼을 클릭하여 가시화 언어, 명세화 언어, 구축 언어, 문서화 언어에 대한 UML의 특징을 확인해 보세요. 

그럼 지금부터 UML이 가지고 있는 각각의 특징들에 대해 자세히 살펴보도록 하겠습니다.